In [1]:
#put the index 

import pandas as pd
variable = pd.Series([8,3,6,5,1], index = ['b', 'd','c', 'e','f'])

In [2]:
variable

b    8
d    3
c    6
e    5
f    1
dtype: int64

In [3]:
my_list = ['apple', 'banana' , 'cherry','mango','pineapple']

In [6]:
variable.reindex(my_list)

apple       NaN
banana      NaN
cherry      NaN
mango       NaN
pineapple   NaN
dtype: float64

In [7]:
variable

b    8
d    3
c    6
e    5
f    1
dtype: int64

In [10]:
#sort the index of the series
new_variable = variable.sort_index()

In [11]:
new_variable

b    8
c    6
d    3
e    5
f    1
dtype: int64

In [13]:
#sort the values
sort_value =new_variable.sort_values()

In [14]:
sort_value

f    1
d    3
e    5
c    6
b    8
dtype: int64

In [15]:
# Both the index and values of the series can be sorted

In [16]:
variable

b    8
d    3
c    6
e    5
f    1
dtype: int64

In [17]:
variable.isin([6,1])

b    False
d    False
c     True
e    False
f     True
dtype: bool

In [18]:
variable[variable.isin([6,1])]

c    6
f    1
dtype: int64

In [19]:
type(variable)

pandas.core.series.Series

In [20]:
type(variable[variable.isin([6,1])])

pandas.core.series.Series

In [21]:
variable.ndim

1

In [22]:
#series has only one dimension

In [23]:
variable.values

array([8, 3, 6, 5, 1], dtype=int64)

In [25]:
#list comprehension to iterate values
[i for i in variable.values]

[8, 3, 6, 5, 1]

In [26]:
#list comprehension to iterate on index
variable.index

Index(['b', 'd', 'c', 'e', 'f'], dtype='object')

In [29]:
[i for i in variable.index]

['b', 'd', 'c', 'e', 'f']

In [30]:
variable.items

<bound method Series.items of b    8
d    3
c    6
e    5
f    1
dtype: int64>

In [31]:
variable.items()

In [32]:
list(variable.items())

[('b', 8), ('d', 3), ('c', 6), ('e', 5), ('f', 1)]

In [33]:
for index, value in variable.items():
    print(index,value)

b 8
d 3
c 6
e 5
f 1

for index, value in variable.items():
    print(value,index)

In [36]:
for index, value in variable.items():
    print(index, "-", value)

b - 8
d - 3
c - 6
e - 5
f - 1

# Indexing and Slicing in Pandas

In [37]:
import pandas as pd

In [38]:
example = pd.Series(['+67', '+90', '+44','+50','+59', '+34','+96'], index = ['Germany', 'Nepal', "India", 'Japan', 'Pakistan', 'America', 'Bhutan'])

In [39]:
example

Germany     +67
Nepal       +90
India       +44
Japan       +50
Pakistan    +59
America     +34
Bhutan      +96
dtype: object

In [40]:
example['Bhutan']

'+96'

In [41]:
# NOTE: We can use numerical index also
example[1]

'+90'

In [43]:
#slicing
#NOTE: both the start and end values are inclusive
example["Nepal" : "America"]

Nepal       +90
India       +44
Japan       +50
Pakistan    +59
America     +34
dtype: object

In [44]:
#Slicing using the numerical index
example[2:5]

India       +44
Japan       +50
Pakistan    +59
dtype: object

# [Start: Stop: Step]

In [45]:
example[2:5:2]

India       +44
Pakistan    +59
dtype: object

In [46]:
example['India']

'+44'

In [47]:
# to get the values of 2 or more, pass their index as a list
example['India', 'Nepal']

KeyError: 'key of type tuple not found and not a MultiIndex'

In [48]:
#pass the list to get the values of 2 or more 
example[['India', 'Pakistan']]

India       +44
Pakistan    +59
dtype: object

# Adding Columns to Data frames

In [49]:
import numpy as np
import pandas as pd

In [50]:
x = np.arange(0,28)

In [51]:
x

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27])

In [52]:
y = np.arange(10)

In [53]:
y

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [54]:
z = np.arange(1,21)

In [55]:
z

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20])

In [56]:
#The the boundary is exclusive

In [57]:
x.reshape(7,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23],
       [24, 25, 26, 27]])

# Changing the data to DataFrame

In [59]:
x =x.reshape(7,4)
df = pd.DataFrame(data = x, columns = ['col1', 'col2', 'col3', 'col4'])

In [61]:
df

   col1  col2  col3  col4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

# Use of dropna()

In [70]:
new_df = df.drop(['col4'],axis = 1)

In [72]:
# the col4 column has been dropped, asis should always be mentioned
new_df

   col1  col2  col3
0     0     1     2
1     4     5     6
2     8     9    10
3    12    13    14
4    16    17    18
5    20    21    22
6    24    25    26

In [74]:
df['col5'] = df['col1'] + df['col2']

In [75]:
df

   col1  col2  col3  col4  col5
0     0     1     2     3     1
1     4     5     6     7     9
2     8     9    10    11    17
3    12    13    14    15    25
4    16    17    18    19    33
5    20    21    22    23    41
6    24    25    26    27    49

In [76]:
df['col6'] = df['col4'] * df['col3']

In [77]:
df

   col1  col2  col3  col4  col5  col6
0     0     1     2     3     1     6
1     4     5     6     7     9    42
2     8     9    10    11    17   110
3    12    13    14    15    25   210
4    16    17    18    19    33   342
5    20    21    22    23    41   506
6    24    25    26    27    49   702

In [78]:
np.arange(28,35)

array([28, 29, 30, 31, 32, 33, 34])

In [82]:
df['col7'] = np.arange(28,35)

In [80]:
df

   col1  col2  col3  col4  col5  col6  col7
0     0     1     2     3     1     6    28
1     4     5     6     7     9    42    29
2     8     9    10    11    17   110    30
3    12    13    14    15    25   210    31
4    16    17    18    19    33   342    32
5    20    21    22    23    41   506    33
6    24    25    26    27    49   702    34

In [83]:
#NOTE: if size of the new col doesn't match then an error will raise

# Setting the index in pandas DataFrame

In [84]:
import numpy as np
import pandas as pd

In [91]:
np.random.seed(101)
df = pd.DataFrame(data = np.random.randn(6,5), index = "A B C D E F".split(), columns = "val1 val2 val3 val4 val5".split())

In [92]:
df

       val1      val2      val3      val4      val5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [93]:
df

       val1      val2      val3      val4      val5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

# Another example of dataframe

In [94]:
import numpy as np
import pandas as pd

In [96]:
np.random.seed(10)

In [97]:
my_data = np.random.randn(6,6)

In [99]:
index = "1,2,3,4,5,6".split(',')

In [100]:
columns = "first,second,third,fourth,fifth,sixth".split(',')

In [101]:
df = pd.DataFrame(data=my_data, index=index, columns=columns)

In [102]:
df

      first    second     third    fourth     fifth     sixth
1  1.331587  0.715279 -1.545400 -0.008384  0.621336 -0.720086
2  0.265512  0.108549  0.004291 -0.174600  0.433026  1.203037
3 -0.965066  1.028274  0.228630  0.445138 -1.136602  0.135137
4  1.484537 -1.079805 -1.977728 -1.743372  0.266070  2.384967
5  1.123691  1.672622  0.099149  1.397996 -0.271248  0.613204
6 -0.267317 -0.549309  0.132708 -0.476142  1.308473  0.195013

# One more example

In [103]:
import numpy as np
import pandas as pd
np.random.seed(99)

In [104]:
new_data = np.random.randn(9,9)

In [106]:
index_used = "1#2#3#4#5#6#7#8#9".split('#')
columns_used = "col1#col2#col3#col4#col5#col6#col7#col8#col9".split('#')

In [107]:
df = pd.DataFrame(data=new_data, index=index_used,columns=columns_used)

In [108]:
df

,col1,col2,col3,col4,col5,col6,col7,col8,col9
1,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
2,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
3,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
4,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
5,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
6,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
7,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
8,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
9,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [110]:
#This transforms the index of the df starting from 0 and goes up
df.reset_index()

,index,col1,col2,col3,col4,col5,col6,col7,col8,col9
0,1,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
1,2,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
2,3,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
3,4,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
4,5,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
5,6,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
6,7,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
7,8,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
8,9,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [111]:
df

,col1,col2,col3,col4,col5,col6,col7,col8,col9
1,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
2,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
3,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
4,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
5,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
6,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
7,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
8,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
9,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [112]:
df.reset_index(drop=True)

,col1,col2,col3,col4,col5,col6,col7,col8,col9
0,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
1,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
2,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
3,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
4,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
5,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
6,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
7,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
8,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [113]:
df

,col1,col2,col3,col4,col5,col6,col7,col8,col9
1,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
2,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
3,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
4,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
5,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
6,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
7,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
8,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
9,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [116]:
#inplace = True, basically changes the df permanently
df.reset_index(inplace=True)

In [117]:
df

,level_0,index,col1,col2,col3,col4,col5,col6,col7,col8,col9
0,0,1,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
1,1,2,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
2,2,3,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
3,3,4,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
4,4,5,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
5,5,6,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
6,6,7,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
7,7,8,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
8,8,9,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [118]:
countries = "Nepal Bhutan India Japan Denmark Korea England America Australia"

In [119]:
countries.split()

['Nepal',
 'Bhutan',
 'India',
 'Japan',
 'Denmark',
 'Korea',
 'England',
 'America',
 'Australia']

In [120]:
countries

'Nepal Bhutan India Japan Denmark Korea England America Australia'

In [121]:
countries= countries.split()

In [122]:
countries

['Nepal',
 'Bhutan',
 'India',
 'Japan',
 'Denmark',
 'Korea',
 'England',
 'America',
 'Australia']

In [123]:
df

,level_0,index,col1,col2,col3,col4,col5,col6,col7,col8,col9
0,0,1,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
1,1,2,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
2,2,3,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
3,3,4,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
4,4,5,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
5,5,6,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
6,6,7,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
7,7,8,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
8,8,9,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [124]:
df["new_index"] = countries

In [125]:
df

,level_0,index,col1,col2,col3,col4,col5,col6,col7,col8,col9,new_index
0,0,1,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069,Nepal
1,1,2,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082,Bhutan
2,2,3,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466,India
3,3,4,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334,Japan
4,4,5,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934,Denmark
5,5,6,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195,Korea
6,6,7,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613,England
7,7,8,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984,America
8,8,9,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224,Australia

In [128]:
df.set_index('new_index',inplace=True)

In [129]:
df

,level_0,index,col1,col2,col3,col4,col5,col6,col7,col8,col9
new_index,,,,,,,,,,,
Nepal,0,1,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
Bhutan,1,2,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
India,2,3,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
Japan,3,4,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
Denmark,4,5,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
Korea,5,6,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
England,6,7,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
America,7,8,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
Australia,8,9,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [133]:
#for column axis = 1 and for row axis = 0
df.drop('index', axis = 1, inplace=True)

In [134]:
df

,level_0,col1,col2,col3,col4,col5,col6,col7,col8,col9
new_index,,,,,,,,,,
Nepal,0,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
Bhutan,1,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
India,2,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
Japan,3,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
Denmark,4,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
Korea,5,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
England,6,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
America,7,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
Australia,8,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [136]:
df.drop('level_0', axis = 1)

,col1,col2,col3,col4,col5,col6,col7,col8,col9
new_index,,,,,,,,,
Nepal,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
Bhutan,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
India,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
Japan,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
Denmark,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
Korea,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
England,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
America,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
Australia,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [137]:
df

,level_0,col1,col2,col3,col4,col5,col6,col7,col8,col9
new_index,,,,,,,,,,
Nepal,0,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
Bhutan,1,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
India,2,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
Japan,3,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
Denmark,4,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
Korea,5,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
England,6,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
America,7,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
Australia,8,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [138]:
df.drop('level_0', axis = 1, inplace=True)

In [139]:
df

,col1,col2,col3,col4,col5,col6,col7,col8,col9
new_index,,,,,,,,,
Nepal,-0.142359,2.057222,0.283262,1.329812,-0.154622,-0.069031,0.755180,0.825647,-0.113069
Bhutan,-2.367838,-0.167049,0.685398,0.023500,0.456201,0.270493,-1.435008,0.882817,-0.580082
India,-0.501565,0.590953,-0.731616,0.261755,-0.855796,-0.187526,-0.373486,-0.461971,-0.816466
Japan,-0.045123,0.121328,0.925953,-0.573820,0.052703,2.207311,0.391822,0.482713,0.433334
Denmark,-1.704292,-0.243908,-2.139704,0.861323,1.700284,-0.528785,1.763478,-1.121608,-1.191934
Korea,0.552732,-0.815981,-0.496647,1.086226,-0.974675,-0.282136,-0.117214,0.378547,0.732195
England,-0.103571,-1.198706,1.010036,2.875360,0.820313,0.560612,-0.375642,-0.252104,-1.389613
America,0.617332,-0.135787,1.287905,-1.036994,1.364332,-0.309957,-0.611117,-0.483106,-0.608984
Australia,-2.088335,0.639322,0.774304,1.278569,0.705276,0.655977,-1.678502,0.183110,-1.133224

In [144]:
df[['col1', 'col2']].isnull().sum()

col1    0
col2    0
dtype: int64

In [145]:
#None of the data are missing or empty

# Removing rows and columns from Panda DataFrames

In [146]:
import numpy as np
import pandas as pd

In [147]:
x = np.arange(0,28).reshape(7,4)

In [148]:
x

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23],
       [24, 25, 26, 27]])

In [168]:
df = pd.DataFrame(data=x, columns=['val1', 'val2', 'val3', 'val4'])

In [169]:
df

   val1  val2  val3  val4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

In [170]:
df.drop(['val1','val2'], axis = 1)

   val3  val4
0     2     3
1     6     7
2    10    11
3    14    15
4    18    19
5    22    23
6    26    27

In [171]:
# for permanent change we must use inplace = True
df

   val1  val2  val3  val4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

In [172]:
df.drop(['val1','val2'], axis = 1)

   val3  val4
0     2     3
1     6     7
2    10    11
3    14    15
4    18    19
5    22    23
6    26    27

In [173]:
df

   val1  val2  val3  val4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

# Row deletion

In [176]:
# for row, axis = 0 and for permanent extraction, inplace = True
df.drop([2,5], axis = 0, inplace=True)

In [177]:
df

   val1  val2  val3  val4
0     0     1     2     3
1     4     5     6     7
3    12    13    14    15
4    16    17    18    19
6    24    25    26    27

# Null values in Pandas Dataframes

In [178]:
import numpy as np
import pandas as pd

In [179]:
df = pd.DataFrame(
{
    'val1': [2, 4, np.nan, 6, np.nan, 8, 10],
    'val2': [123, np.nan, 456, np.nan, 789, 246, 357],
    'val3': ['France', 'Greece', 'USA', 'Japan', 'Sweden', 'Norway', 'Turkey']
}
)

In [180]:
df

   val1   val2    val3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [181]:
df.isnull

<bound method DataFrame.isnull of    val1   val2    val3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey>

In [182]:
df.isnull()

    val1   val2   val3
0  False  False  False
1  False   True  False
2   True  False  False
3  False   True  False
4   True  False  False
5  False  False  False
6  False  False  False

In [183]:
df.isnull().sum()

val1    2
val2    2
val3    0
dtype: int64

In [184]:
len(df)

7

In [187]:
#calculate the percentage of the null values in the dataframe
df.isnull().sum()/len(df)*100

val1    28.571429
val2    28.571429
val3     0.000000
dtype: float64

In [188]:
df.notnull()

    val1   val2  val3
0   True   True  True
1   True  False  True
2  False   True  True
3   True  False  True
4  False   True  True
5   True   True  True
6   True   True  True

In [189]:
#total of the not null values
df.notnull().sum()

val1    5
val2    5
val3    7
dtype: int64

In [190]:
df['val1'].notnull()

0     True
1     True
2    False
3     True
4    False
5     True
6     True
Name: val1, dtype: bool

In [192]:
df[df['val1'].notnull()]

   val1   val2    val3
0   2.0  123.0  France
1   4.0    NaN  Greece
3   6.0    NaN   Japan
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [193]:
df

   val1   val2    val3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [195]:
#search for any null value, if finds, returns false, esle true
df.isnull().any()

val1     True
val2     True
val3    False
dtype: bool

In [196]:
df.isnull().any(axis= 1)

0    False
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [197]:
df.isnull().any(axis=0)

val1     True
val2     True
val3    False
dtype: bool

In [198]:
condition = df.isnull().any(axis= 1)

In [200]:
df[condition]

   val1   val2    val3
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden

In [202]:
#check either all the values are not null
df.notnull().all()

val1    False
val2    False
val3     True
dtype: bool

# filling in the missing values

In [203]:
import numpy as np
import pandas as pd

In [208]:
df = pd.DataFrame({
    'val1': [1,2,3,4,5,6,7,8,9,10,np.nan],
    'val2': [np.nan, 2, 4, 6, np.nan, 8, 10, np.nan, 12, np.nan,14]
})

In [209]:
df

    val1  val2
0    1.0   NaN
1    2.0   2.0
2    3.0   4.0
3    4.0   6.0
4    5.0   NaN
5    6.0   8.0
6    7.0  10.0
7    8.0   NaN
8    9.0  12.0
9   10.0   NaN
10   NaN  14.0

In [210]:
df.fillna(100)

     val1   val2
0     1.0  100.0
1     2.0    2.0
2     3.0    4.0
3     4.0    6.0
4     5.0  100.0
5     6.0    8.0
6     7.0   10.0
7     8.0  100.0
8     9.0   12.0
9    10.0  100.0
10  100.0   14.0

In [212]:
df['val1'].fillna(100)

0       1.0
1       2.0
2       3.0
3       4.0
4       5.0
5       6.0
6       7.0
7       8.0
8       9.0
9      10.0
10    100.0
Name: val1, dtype: float64

In [213]:
df['val2'].fillna(30)

0     30.0
1      2.0
2      4.0
3      6.0
4     30.0
5      8.0
6     10.0
7     30.0
8     12.0
9     30.0
10    14.0
Name: val2, dtype: float64

In [214]:
df.mean()

val1    5.5
val2    8.0
dtype: float64

In [216]:
#fill the null value with mean of the column
df.fillna(df.mean())

    val1  val2
0    1.0   8.0
1    2.0   2.0
2    3.0   4.0
3    4.0   6.0
4    5.0   8.0
5    6.0   8.0
6    7.0  10.0
7    8.0   8.0
8    9.0  12.0
9   10.0   8.0
10   5.5  14.0

In [217]:
#fill the each column separately

df.fillna({'val1': 100, 'val2':200})

     val1   val2
0     1.0  200.0
1     2.0    2.0
2     3.0    4.0
3     4.0    6.0
4     5.0  200.0
5     6.0    8.0
6     7.0   10.0
7     8.0  200.0
8     9.0   12.0
9    10.0  200.0
10  100.0   14.0

In [218]:
#fill the nan of one column by another column's mean
df['val1'].fillna(df['val2'].mean())

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0
7      8.0
8      9.0
9     10.0
10     8.0
Name: val1, dtype: float64

In [219]:
df['val2'].fillna(df['val1'].mean())

0      5.5
1      2.0
2      4.0
3      6.0
4      5.5
5      8.0
6     10.0
7      5.5
8     12.0
9      5.5
10    14.0
Name: val2, dtype: float64

In [220]:
df

    val1  val2
0    1.0   NaN
1    2.0   2.0
2    3.0   4.0
3    4.0   6.0
4    5.0   NaN
5    6.0   8.0
6    7.0  10.0
7    8.0   NaN
8    9.0  12.0
9   10.0   NaN
10   NaN  14.0

In [222]:
df['val3'] = ['Nepal', 'sweden', 'srilanka', 'japan', 'maldives', 'korea', 'pakistan', 'myanmar', 'barma', 'china', 'afganistan']

In [223]:
df

    val1  val2        val3
0    1.0   NaN       Nepal
1    2.0   2.0      sweden
2    3.0   4.0    srilanka
3    4.0   6.0       japan
4    5.0   NaN    maldives
5    6.0   8.0       korea
6    7.0  10.0    pakistan
7    8.0   NaN     myanmar
8    9.0  12.0       barma
9   10.0   NaN       china
10   NaN  14.0  afganistan

In [224]:
, # filling the missing categorical data
df['val3'] [0::2] = np.nan

C:\Users\Dell\AppData\Local\Temp\ipykernel_16860\628095669.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['val3'] [0::2] = np.nan

In [225]:
df

    val1  val2     val3
0    1.0   NaN      NaN
1    2.0   2.0   sweden
2    3.0   4.0      NaN
3    4.0   6.0    japan
4    5.0   NaN      NaN
5    6.0   8.0    korea
6    7.0  10.0      NaN
7    8.0   NaN  myanmar
8    9.0  12.0      NaN
9   10.0   NaN    china
10   NaN  14.0      NaN

In [230]:
#fill the nan by a string
df['val3'].fillna('Turkey', inplace=False)

0      Turkey
1      sweden
2      Turkey
3       japan
4      Turkey
5       korea
6      Turkey
7     myanmar
8      Turkey
9       china
10     Turkey
Name: val3, dtype: object

In [231]:
df

    val1  val2     val3
0    1.0   NaN   Turkey
1    2.0   2.0   sweden
2    3.0   4.0   Turkey
3    4.0   6.0    japan
4    5.0   NaN   Turkey
5    6.0   8.0    korea
6    7.0  10.0   Turkey
7    8.0   NaN  myanmar
8    9.0  12.0   Turkey
9   10.0   NaN    china
10   NaN  14.0   Turkey

In [232]:
df.fillna()

ValueError: Must specify a fill 'value' or 'method'.

# Multi-index and Index Hierarchy in Pandas DF

In [233]:
import numpy as np
import pandas as pd

In [234]:
inside = ['class A', 'class B', 'class C', 'class A', 'class B', 'class C']
outside = ['school 1', 'school 1', 'school 1', 'class 2', 'class 2', 'class2']

In [235]:
zip(outside, inside)

In [236]:
multi_index = list(zip(outside, inside))

In [237]:
 multi_index

[('school 1', 'class A'),
 ('school 1', 'class B'),
 ('school 1', 'class C'),
 ('class 2', 'class A'),
 ('class 2', 'class B'),
 ('class2', 'class C')]

In [238]:
hier_index = pd.MultiIndex.from_tuples(multi_index)

In [239]:
hier_index

MultiIndex([('school 1', 'class A'),
            ('school 1', 'class B'),
            ('school 1', 'class C'),
            ( 'class 2', 'class A'),
            ( 'class 2', 'class B'),
            (  'class2', 'class C')],
           )

In [240]:
np.random.seed(10)

In [241]:
df = pd.DataFrame(np.random.randint(70, 100, size = (6,2)), index=hier_index, columns= ['1_semester', '2_semester'])

In [242]:
df

                  1_semester  2_semester
school 1 class A          79          99
         class B          74          85
         class C          70          87
class 2  class A          97          98
         class B          95          99
class2   class C          86          99

# np.random.normal( )   VS np.random.randn()

Both `np.random.normal` and `np.random.randn` are functions provided by the NumPy library for generating random numbers from a normal distribution. However, there is a slight difference in how they are used.

1. `np.random.normal`:
   - This function allows you to specify the mean (`loc`) and standard deviation (`scale`) of the normal distribution explicitly.
   - You can also specify the `size` parameter to determine the shape of the output array. For example, `size=5` generates a 1D array with 5 random numbers, `size=(2, 3)` generates a 2D array with 2 rows and 3 columns, and so on.
   - The usage is typically `np.random.normal(loc, scale, size)`, where `loc` is the mean, `scale` is the standard deviation, and `size` is the desired shape of the output array.

2. `np.random.randn`:
   - This function generates random numbers from a standard normal distribution, which has a mean of 0 and a standard deviation of 1.
   - You can specify the `size` parameter to determine the shape of the output array, similar to `np.random.normal`.
   - The usage is typically `np.random.randn(size)`, where `size` is the desired shape of the output array.

In summary, the main difference between the two functions is that `np.random.normal` allows you to specify the mean and standard deviation explicitly, whereas `np.random.randn` generates random numbers from a standard normal distribution with a mean of 0 and a standard deviation of 1.